Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/include/component/intctrl.h
#define INTCTRL_RSRL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_RSRL Position) Timer x Interrupt */
#define INTCTRL_RSRL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_RSRL_TIMER_Pos)            /* (INTCTRL_RSRL Mask) TIMER */
#define INTCTRL_RSRL_TIMER(value)             (INTCTRL_RSRL_TIMER_Msk & (_UINT32_(value) << INTCTRL_RSRL_TIMER_Pos)) 
#define INTCTRL_RSRL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_RSRL Position) Crypto Interrupt 3 */
#define INTCTRL_RSRL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_RSRL_CRYPTO_Pos)           /* (INTCTRL_RSRL Mask) CRYPTO */
#define INTCTRL_RSRL_CRYPTO(value)            (INTCTRL_RSRL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_RSRL_CRYPTO_Pos)) 

/* -------- INTCTRL_ENAL : (INTCTRL Offset: 0x10) (R/W 32) Interrupt Enable Register Low -------- */
#define INTCTRL_ENAL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_ENAL) Interrupt Enable Register Low  Reset Value */

#define INTCTRL_ENAL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_ENAL) RTC Interrupt Position */
#define INTCTRL_ENAL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_ENAL_RTC_Pos)              /* (INTCTRL_ENAL) RTC Interrupt Mask */
#define INTCTRL_ENAL_RTC(value)               (INTCTRL_ENAL_RTC_Msk & (_UINT32_(value) << INTCTRL_ENAL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_ENAL) Tamper Interrupt Position */
#define INTCTRL_ENAL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_ENAL_TAMPER_Pos)           /* (INTCTRL_ENAL) Tamper Interrupt Mask */
#define INTCTRL_ENAL_TAMPER(value)            (INTCTRL_ENAL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_ENAL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_ENAL) External DMA Interrupt Position */
#define INTCTRL_ENAL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_ENAL_EXTDMA_Pos)           /* (INTCTRL_ENAL) External DMA Interrupt Mask */
#define INTCTRL_ENAL_EXTDMA(value)            (INTCTRL_ENAL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_ENAL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_ENAL) Watch Dog Interrupt Position */
#define INTCTRL_ENAL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_ENAL_WDOG_Pos)             /* (INTCTRL_ENAL) Watch Dog Interrupt Mask */
#define INTCTRL_ENAL_WDOG(value)              (INTCTRL_ENAL_WDOG_Msk & (_UINT32_(value) << INTCTRL_ENAL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_ENAL) Tamper Busy Interrupt Position */
#define INTCTRL_ENAL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_ENAL_TAMPER_BUSY_Pos)      /* (INTCTRL_ENAL) Tamper Busy Interrupt Mask */
#define INTCTRL_ENAL_TAMPER_BUSY(value)       (INTCTRL_ENAL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_ENAL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_ENAL) Timer 0 Interrupt Position */
#define INTCTRL_ENAL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_ENAL_TIMER0_Pos)           /* (INTCTRL_ENAL) Timer 0 Interrupt Mask */
#define INTCTRL_ENAL_TIMER0(value)            (INTCTRL_ENAL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_ENAL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_ENAL) Timer 1 interrupt Position */
#define INTCTRL_ENAL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_ENAL_TIMER1_Pos)           /* (INTCTRL_ENAL) Timer 1 interrupt Mask */
#define INTCTRL_ENAL_TIMER1(value)            (INTCTRL_ENAL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_ENAL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_ENAL) Power Down Interrupt Position */
#define INTCTRL_ENAL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_ENAL_PWRDOWN_Pos)          /* (INTCTRL_ENAL) Power Down Interrupt Mask */
#define INTCTRL_ENAL_PWRDOWN(value)           (INTCTRL_ENAL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_ENAL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_ENAL) Mailbox TX Interrupt Position */
#define INTCTRL_ENAL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_ENAL_MB_TX_Pos)            /* (INTCTRL_ENAL) Mailbox TX Interrupt Mask */
#define INTCTRL_ENAL_MB_TX(value)             (INTCTRL_ENAL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_ENAL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_ENAL) Mailbox RX Interrupt Position */
#define INTCTRL_ENAL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_ENAL_MB_RX_Pos)            /* (INTCTRL_ENAL) Mailbox RX Interrupt Mask */
#define INTCTRL_ENAL_MB_RX(value)             (INTCTRL_ENAL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_ENAL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_ENAL) Crypto Interrupt 0 Position */
#define INTCTRL_ENAL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_ENAL_CRYPTO0_Pos)          /* (INTCTRL_ENAL) Crypto Interrupt 0 Mask */
#define INTCTRL_ENAL_CRYPTO0(value)           (INTCTRL_ENAL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_ENAL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_ENAL) Crypto Interrupt 1 Position */
#define INTCTRL_ENAL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_ENAL_CRYPTO1_Pos)          /* (INTCTRL_ENAL) Crypto Interrupt 1 Mask */
#define INTCTRL_ENAL_CRYPTO1(value)           (INTCTRL_ENAL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_ENAL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_ENAL) Crypto Interrupt 2 Position */
#define INTCTRL_ENAL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_ENAL_CRYPTO2_Pos)          /* (INTCTRL_ENAL) Crypto Interrupt 2 Mask */
#define INTCTRL_ENAL_CRYPTO2(value)           (INTCTRL_ENAL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_ENAL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_ENAL) Crypto Interrupt 3 Position */
#define INTCTRL_ENAL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_ENAL_CRYPTO3_Pos)          /* (INTCTRL_ENAL) Crypto Interrupt 3 Mask */
#define INTCTRL_ENAL_CRYPTO3(value)           (INTCTRL_ENAL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_ENAL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_ENAL register */
#define INTCTRL_ENAL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_ENAL) Register Mask  */

#define INTCTRL_ENAL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_ENAL Position) Timer x Interrupt */
#define INTCTRL_ENAL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_ENAL_TIMER_Pos)            /* (INTCTRL_ENAL Mask) TIMER */
#define INTCTRL_ENAL_TIMER(value)             (INTCTRL_ENAL_TIMER_Msk & (_UINT32_(value) << INTCTRL_ENAL_TIMER_Pos)) 
#define INTCTRL_ENAL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_ENAL Position) Crypto Interrupt 3 */
#define INTCTRL_ENAL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_ENAL_CRYPTO_Pos)           /* (INTCTRL_ENAL Mask) CRYPTO */
#define INTCTRL_ENAL_CRYPTO(value)            (INTCTRL_ENAL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_ENAL_CRYPTO_Pos)) 

/* -------- INTCTRL_CLRL : (INTCTRL Offset: 0x18) ( /W 32) Interrupt Disable Register Low -------- */
#define INTCTRL_CLRL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_CLRL) Interrupt Disable Register Low  Reset Value */

#define INTCTRL_CLRL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_CLRL) RTC Interrupt Position */
#define INTCTRL_CLRL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_CLRL_RTC_Pos)              /* (INTCTRL_CLRL) RTC Interrupt Mask */
#define INTCTRL_CLRL_RTC(value)               (INTCTRL_CLRL_RTC_Msk & (_UINT32_(value) << INTCTRL_CLRL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_CLRL) Tamper Interrupt Position */
#define INTCTRL_CLRL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_CLRL_TAMPER_Pos)           /* (INTCTRL_CLRL) Tamper Interrupt Mask */
#define INTCTRL_CLRL_TAMPER(value)            (INTCTRL_CLRL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_CLRL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_CLRL) External DMA Interrupt Position */
#define INTCTRL_CLRL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_CLRL_EXTDMA_Pos)           /* (INTCTRL_CLRL) External DMA Interrupt Mask */
#define INTCTRL_CLRL_EXTDMA(value)            (INTCTRL_CLRL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_CLRL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_CLRL) Watch Dog Interrupt Position */
#define INTCTRL_CLRL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_CLRL_WDOG_Pos)             /* (INTCTRL_CLRL) Watch Dog Interrupt Mask */
#define INTCTRL_CLRL_WDOG(value)              (INTCTRL_CLRL_WDOG_Msk & (_UINT32_(value) << INTCTRL_CLRL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_CLRL) Tamper Busy Interrupt Position */
#define INTCTRL_CLRL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_CLRL_TAMPER_BUSY_Pos)      /* (INTCTRL_CLRL) Tamper Busy Interrupt Mask */
#define INTCTRL_CLRL_TAMPER_BUSY(value)       (INTCTRL_CLRL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_CLRL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_CLRL) Timer 0 Interrupt Position */
#define INTCTRL_CLRL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_CLRL_TIMER0_Pos)           /* (INTCTRL_CLRL) Timer 0 Interrupt Mask */
#define INTCTRL_CLRL_TIMER0(value)            (INTCTRL_CLRL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_CLRL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_CLRL) Timer 1 interrupt Position */
#define INTCTRL_CLRL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_CLRL_TIMER1_Pos)           /* (INTCTRL_CLRL) Timer 1 interrupt Mask */
#define INTCTRL_CLRL_TIMER1(value)            (INTCTRL_CLRL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_CLRL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_CLRL) Power Down Interrupt Position */
#define INTCTRL_CLRL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_CLRL_PWRDOWN_Pos)          /* (INTCTRL_CLRL) Power Down Interrupt Mask */
#define INTCTRL_CLRL_PWRDOWN(value)           (INTCTRL_CLRL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_CLRL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_CLRL) Mailbox TX Interrupt Position */
#define INTCTRL_CLRL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_CLRL_MB_TX_Pos)            /* (INTCTRL_CLRL) Mailbox TX Interrupt Mask */
#define INTCTRL_CLRL_MB_TX(value)             (INTCTRL_CLRL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_CLRL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_CLRL) Mailbox RX Interrupt Position */
#define INTCTRL_CLRL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_CLRL_MB_RX_Pos)            /* (INTCTRL_CLRL) Mailbox RX Interrupt Mask */
#define INTCTRL_CLRL_MB_RX(value)             (INTCTRL_CLRL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_CLRL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_CLRL) Crypto Interrupt 0 Position */
#define INTCTRL_CLRL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_CLRL_CRYPTO0_Pos)          /* (INTCTRL_CLRL) Crypto Interrupt 0 Mask */
#define INTCTRL_CLRL_CRYPTO0(value)           (INTCTRL_CLRL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_CLRL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_CLRL) Crypto Interrupt 1 Position */
#define INTCTRL_CLRL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_CLRL_CRYPTO1_Pos)          /* (INTCTRL_CLRL) Crypto Interrupt 1 Mask */
#define INTCTRL_CLRL_CRYPTO1(value)           (INTCTRL_CLRL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_CLRL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_CLRL) Crypto Interrupt 2 Position */
#define INTCTRL_CLRL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_CLRL_CRYPTO2_Pos)          /* (INTCTRL_CLRL) Crypto Interrupt 2 Mask */
#define INTCTRL_CLRL_CRYPTO2(value)           (INTCTRL_CLRL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_CLRL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_CLRL) Crypto Interrupt 3 Position */
#define INTCTRL_CLRL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_CLRL_CRYPTO3_Pos)          /* (INTCTRL_CLRL) Crypto Interrupt 3 Mask */
#define INTCTRL_CLRL_CRYPTO3(value)           (INTCTRL_CLRL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_CLRL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_CLRL register */
#define INTCTRL_CLRL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_CLRL) Register Mask  */

#define INTCTRL_CLRL_TIMER_Pos                _UINT32_(6)                                          /* (INTCTRL_CLRL Position) Timer x Interrupt */
#define INTCTRL_CLRL_TIMER_Msk                (_UINT32_(0x3) << INTCTRL_CLRL_TIMER_Pos)            /* (INTCTRL_CLRL Mask) TIMER */
#define INTCTRL_CLRL_TIMER(value)             (INTCTRL_CLRL_TIMER_Msk & (_UINT32_(value) << INTCTRL_CLRL_TIMER_Pos)) 
#define INTCTRL_CLRL_CRYPTO_Pos               _UINT32_(16)                                         /* (INTCTRL_CLRL Position) Crypto Interrupt 3 */
#define INTCTRL_CLRL_CRYPTO_Msk               (_UINT32_(0xF) << INTCTRL_CLRL_CRYPTO_Pos)           /* (INTCTRL_CLRL Mask) CRYPTO */
#define INTCTRL_CLRL_CRYPTO(value)            (INTCTRL_CLRL_CRYPTO_Msk & (_UINT32_(value) << INTCTRL_CLRL_CRYPTO_Pos)) 

/* -------- INTCTRL_TSTL : (INTCTRL Offset: 0x20) (R/W 32) Interrupt Test Source Register Low -------- */
#define INTCTRL_TSTL_RESETVALUE               _UINT32_(0x00)                                       /*  (INTCTRL_TSTL) Interrupt Test Source Register Low  Reset Value */

#define INTCTRL_TSTL_RTC_Pos                  _UINT32_(0)                                          /* (INTCTRL_TSTL) RTC Interrupt Position */
#define INTCTRL_TSTL_RTC_Msk                  (_UINT32_(0x1) << INTCTRL_TSTL_RTC_Pos)              /* (INTCTRL_TSTL) RTC Interrupt Mask */
#define INTCTRL_TSTL_RTC(value)               (INTCTRL_TSTL_RTC_Msk & (_UINT32_(value) << INTCTRL_TSTL_RTC_Pos)) /* Assigment of value for RTC in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_TAMPER_Pos               _UINT32_(1)                                          /* (INTCTRL_TSTL) Tamper Interrupt Position */
#define INTCTRL_TSTL_TAMPER_Msk               (_UINT32_(0x1) << INTCTRL_TSTL_TAMPER_Pos)           /* (INTCTRL_TSTL) Tamper Interrupt Mask */
#define INTCTRL_TSTL_TAMPER(value)            (INTCTRL_TSTL_TAMPER_Msk & (_UINT32_(value) << INTCTRL_TSTL_TAMPER_Pos)) /* Assigment of value for TAMPER in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_EXTDMA_Pos               _UINT32_(2)                                          /* (INTCTRL_TSTL) External DMA Interrupt Position */
#define INTCTRL_TSTL_EXTDMA_Msk               (_UINT32_(0x1) << INTCTRL_TSTL_EXTDMA_Pos)           /* (INTCTRL_TSTL) External DMA Interrupt Mask */
#define INTCTRL_TSTL_EXTDMA(value)            (INTCTRL_TSTL_EXTDMA_Msk & (_UINT32_(value) << INTCTRL_TSTL_EXTDMA_Pos)) /* Assigment of value for EXTDMA in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_WDOG_Pos                 _UINT32_(3)                                          /* (INTCTRL_TSTL) Watch Dog Interrupt Position */
#define INTCTRL_TSTL_WDOG_Msk                 (_UINT32_(0x1) << INTCTRL_TSTL_WDOG_Pos)             /* (INTCTRL_TSTL) Watch Dog Interrupt Mask */
#define INTCTRL_TSTL_WDOG(value)              (INTCTRL_TSTL_WDOG_Msk & (_UINT32_(value) << INTCTRL_TSTL_WDOG_Pos)) /* Assigment of value for WDOG in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_TAMPER_BUSY_Pos          _UINT32_(5)                                          /* (INTCTRL_TSTL) Tamper Busy Interrupt Position */
#define INTCTRL_TSTL_TAMPER_BUSY_Msk          (_UINT32_(0x1) << INTCTRL_TSTL_TAMPER_BUSY_Pos)      /* (INTCTRL_TSTL) Tamper Busy Interrupt Mask */
#define INTCTRL_TSTL_TAMPER_BUSY(value)       (INTCTRL_TSTL_TAMPER_BUSY_Msk & (_UINT32_(value) << INTCTRL_TSTL_TAMPER_BUSY_Pos)) /* Assigment of value for TAMPER_BUSY in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_TIMER0_Pos               _UINT32_(6)                                          /* (INTCTRL_TSTL) Timer 0 Interrupt Position */
#define INTCTRL_TSTL_TIMER0_Msk               (_UINT32_(0x1) << INTCTRL_TSTL_TIMER0_Pos)           /* (INTCTRL_TSTL) Timer 0 Interrupt Mask */
#define INTCTRL_TSTL_TIMER0(value)            (INTCTRL_TSTL_TIMER0_Msk & (_UINT32_(value) << INTCTRL_TSTL_TIMER0_Pos)) /* Assigment of value for TIMER0 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_TIMER1_Pos               _UINT32_(7)                                          /* (INTCTRL_TSTL) Timer 1 interrupt Position */
#define INTCTRL_TSTL_TIMER1_Msk               (_UINT32_(0x1) << INTCTRL_TSTL_TIMER1_Pos)           /* (INTCTRL_TSTL) Timer 1 interrupt Mask */
#define INTCTRL_TSTL_TIMER1(value)            (INTCTRL_TSTL_TIMER1_Msk & (_UINT32_(value) << INTCTRL_TSTL_TIMER1_Pos)) /* Assigment of value for TIMER1 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_PWRDOWN_Pos              _UINT32_(11)                                         /* (INTCTRL_TSTL) Power Down Interrupt Position */
#define INTCTRL_TSTL_PWRDOWN_Msk              (_UINT32_(0x1) << INTCTRL_TSTL_PWRDOWN_Pos)          /* (INTCTRL_TSTL) Power Down Interrupt Mask */
#define INTCTRL_TSTL_PWRDOWN(value)           (INTCTRL_TSTL_PWRDOWN_Msk & (_UINT32_(value) << INTCTRL_TSTL_PWRDOWN_Pos)) /* Assigment of value for PWRDOWN in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_MB_TX_Pos                _UINT32_(14)                                         /* (INTCTRL_TSTL) Mailbox TX Interrupt Position */
#define INTCTRL_TSTL_MB_TX_Msk                (_UINT32_(0x1) << INTCTRL_TSTL_MB_TX_Pos)            /* (INTCTRL_TSTL) Mailbox TX Interrupt Mask */
#define INTCTRL_TSTL_MB_TX(value)             (INTCTRL_TSTL_MB_TX_Msk & (_UINT32_(value) << INTCTRL_TSTL_MB_TX_Pos)) /* Assigment of value for MB_TX in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_MB_RX_Pos                _UINT32_(15)                                         /* (INTCTRL_TSTL) Mailbox RX Interrupt Position */
#define INTCTRL_TSTL_MB_RX_Msk                (_UINT32_(0x1) << INTCTRL_TSTL_MB_RX_Pos)            /* (INTCTRL_TSTL) Mailbox RX Interrupt Mask */
#define INTCTRL_TSTL_MB_RX(value)             (INTCTRL_TSTL_MB_RX_Msk & (_UINT32_(value) << INTCTRL_TSTL_MB_RX_Pos)) /* Assigment of value for MB_RX in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_CRYPTO0_Pos              _UINT32_(16)                                         /* (INTCTRL_TSTL) Crypto Interrupt 0 Position */
#define INTCTRL_TSTL_CRYPTO0_Msk              (_UINT32_(0x1) << INTCTRL_TSTL_CRYPTO0_Pos)          /* (INTCTRL_TSTL) Crypto Interrupt 0 Mask */
#define INTCTRL_TSTL_CRYPTO0(value)           (INTCTRL_TSTL_CRYPTO0_Msk & (_UINT32_(value) << INTCTRL_TSTL_CRYPTO0_Pos)) /* Assigment of value for CRYPTO0 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_CRYPTO1_Pos              _UINT32_(17)                                         /* (INTCTRL_TSTL) Crypto Interrupt 1 Position */
#define INTCTRL_TSTL_CRYPTO1_Msk              (_UINT32_(0x1) << INTCTRL_TSTL_CRYPTO1_Pos)          /* (INTCTRL_TSTL) Crypto Interrupt 1 Mask */
#define INTCTRL_TSTL_CRYPTO1(value)           (INTCTRL_TSTL_CRYPTO1_Msk & (_UINT32_(value) << INTCTRL_TSTL_CRYPTO1_Pos)) /* Assigment of value for CRYPTO1 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_CRYPTO2_Pos              _UINT32_(18)                                         /* (INTCTRL_TSTL) Crypto Interrupt 2 Position */
#define INTCTRL_TSTL_CRYPTO2_Msk              (_UINT32_(0x1) << INTCTRL_TSTL_CRYPTO2_Pos)          /* (INTCTRL_TSTL) Crypto Interrupt 2 Mask */
#define INTCTRL_TSTL_CRYPTO2(value)           (INTCTRL_TSTL_CRYPTO2_Msk & (_UINT32_(value) << INTCTRL_TSTL_CRYPTO2_Pos)) /* Assigment of value for CRYPTO2 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_CRYPTO3_Pos              _UINT32_(19)                                         /* (INTCTRL_TSTL) Crypto Interrupt 3 Position */
#define INTCTRL_TSTL_CRYPTO3_Msk              (_UINT32_(0x1) << INTCTRL_TSTL_CRYPTO3_Pos)          /* (INTCTRL_TSTL) Crypto Interrupt 3 Mask */
#define INTCTRL_TSTL_CRYPTO3(value)           (INTCTRL_TSTL_CRYPTO3_Msk & (_UINT32_(value) << INTCTRL_TSTL_CRYPTO3_Pos)) /* Assigment of value for CRYPTO3 in the INTCTRL_TSTL register */
#define INTCTRL_TSTL_Msk                      _UINT32_(0x000FC8EF)                                 /* (INTCTRL_TSTL) Register Mask  */

