Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.130/PIC32CK-SG00-S1/include/component/intctrl.h
#define INTCTRL_PIN_PIN_Pos                   _UINT32_(0)                                          /* (INTCTRL_PIN) Pending IRQ Num Position */
#define INTCTRL_PIN_PIN_Msk                   (_UINT32_(0x3F) << INTCTRL_PIN_PIN_Pos)              /* (INTCTRL_PIN) Pending IRQ Num Mask */
#define INTCTRL_PIN_PIN(value)                (INTCTRL_PIN_PIN_Msk & (_UINT32_(value) << INTCTRL_PIN_PIN_Pos)) /* Assigment of value for PIN in the INTCTRL_PIN register */
#define INTCTRL_PIN_Msk                       _UINT32_(0x0000003F)                                 /* (INTCTRL_PIN) Register Mask  */


/** \brief INTCTRL register offsets definitions */
#define INTCTRL_STATL_REG_OFST         _UINT32_(0x00)      /* (INTCTRL_STATL) Interrupt Status Register Low Offset */
#define INTCTRL_RSRL_REG_OFST          _UINT32_(0x08)      /* (INTCTRL_RSRL) Interrupt Raw Status Register Low Offset */
#define INTCTRL_ENAL_REG_OFST          _UINT32_(0x10)      /* (INTCTRL_ENAL) Interrupt Enable Register Low Offset */
#define INTCTRL_CLRL_REG_OFST          _UINT32_(0x18)      /* (INTCTRL_CLRL) Interrupt Disable Register Low Offset */
#define INTCTRL_TSTL_REG_OFST          _UINT32_(0x20)      /* (INTCTRL_TSTL) Interrupt Test Source Register Low Offset */
#define INTCTRL_SELL_REG_OFST          _UINT32_(0x28)      /* (INTCTRL_SELL) Interrupt Source Selection Register Low Offset */
#define INTCTRL_APRL_REG_OFST          _UINT32_(0x30)      /* (INTCTRL_APRL) Interrupt Activation Polarity Register Low Offset */
#define INTCTRL_ATRL_REG_OFST          _UINT32_(0x38)      /* (INTCTRL_ATRL) Interrupt Activation Type Register Low Offset */
#define INTCTRL_ITRL_REG_OFST          _UINT32_(0x40)      /* (INTCTRL_ITRL) Interrupt Type register Low Offset */
#define INTCTRL_PIN_REG_OFST           _UINT32_(0x48)      /* (INTCTRL_PIN) Interrupt Pending IRQ Num Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief INTCTRL register API structure */
typedef struct
{  /* eSecure Interrupt Controller Module */
  __I   uint32_t                       INTCTRL_STATL;      /**< Offset: 0x00 (R/   32) Interrupt Status Register Low */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       INTCTRL_RSRL;       /**< Offset: 0x08 (R/W  32) Interrupt Raw Status Register Low */
  __I   uint8_t                        Reserved2[0x04];
  __IO  uint32_t                       INTCTRL_ENAL;       /**< Offset: 0x10 (R/W  32) Interrupt Enable Register Low */
  __I   uint8_t                        Reserved3[0x04];
  __O   uint32_t                       INTCTRL_CLRL;       /**< Offset: 0x18 ( /W  32) Interrupt Disable Register Low */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       INTCTRL_TSTL;       /**< Offset: 0x20 (R/W  32) Interrupt Test Source Register Low */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       INTCTRL_SELL;       /**< Offset: 0x28 (R/W  32) Interrupt Source Selection Register Low */
  __I   uint8_t                        Reserved6[0x04];
  __IO  uint32_t                       INTCTRL_APRL;       /**< Offset: 0x30 (R/W  32) Interrupt Activation Polarity Register Low */
  __I   uint8_t                        Reserved7[0x04];
  __IO  uint32_t                       INTCTRL_ATRL;       /**< Offset: 0x38 (R/W  32) Interrupt Activation Type Register Low */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       INTCTRL_ITRL;       /**< Offset: 0x40 (R/W  32) Interrupt Type register Low */
  __I   uint8_t                        Reserved9[0x04];
  __I   uint32_t                       INTCTRL_PIN;        /**< Offset: 0x48 (R/   32) Interrupt Pending IRQ Num */
} intctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CKSG00_INTCTRL_COMPONENT_H_ */
